import pytest


@pytest.fixture
def data_transactions():
    """
    Фикстура для предоставления данных для создания DataFrame.
    """
    return {
        "Дата операции": ["2023-04-01", "2023-05-01", "2023-06-01"],
        "Сумма операции": [100, 200, 300],
        "Категория": ["Продукты", "Продукты", "Продукты"],
    }


@pytest.fixture
def data_transactions_date_time():
    """
    Фикстура для предоставления данных для создания DataFrame.
    """
    return (
        {
            "Дата операции": ["26.07.2023 10:30:00", "27.07.2023 11:30:00", "28.07.2023 12:30:00"],
            "Сумма операции": [100, 200, 300],
            "Категория": ["Продукты", "Развлечения", "Одежда"],
        },
        {"Дата операции": ["27.07.2023 11:30:00"], "Сумма операции": [200], "Категория": ["Развлечения"]},
    )


@pytest.fixture
def data_transactions_empty():
    """
    Фикстура для предоставления пустых данных для создания DataFrame.
    """
    return {"Дата операции": [], "Сумма операции": [], "Категория": []}
